RT-CUSTOMZ/WortUhr/Software/ESP8266/ESP-WordClock/http.cpp
    table_header (header_cols, MAIN_HEADER_COLS);
    table_row ("Version", version, "");
    table_row ("ESP8266 version", esp_firmware_version, "");
    table_row ("RTC", rtc_is_up ? "online" : "offline", "");
    table_row ("EEPROM", eeprom_is_up ? "online" : "offline", "");

    if (eeprom_is_up)
    {
        table_row ("EEPROM Version", eeprom_version, "");
    }

    table_row ("DFPlayer", dfplayer_is_up ? "online" : "offline", "");

    if (dfplayer_is_up)
    {
        char dfplayer_version_buf[16];

        sprintf (dfplayer_version_buf, "%04x", dfplayer_version);
        table_row ("DFPlayer Version", dfplayer_version_buf, "");
    }

    table_row ("Display power", get_numvar (DISPLAY_POWER_NUM_VAR) ? "on" : "off", "");
    table_trailer ();

    table_header (datetime_header_cols, DATETIME_HEADER_COLS);
    table_row_inputs (thispage, "datetime", 5, ids, desc, values, maxlen, maxsize);
    table_trailer ();

    table_header (header_cols, TICKER_HEADER_COLS);
    table_row_input (thispage, 3, "Ticker", "ticker", "", MAX_TICKER_TEXT_LEN);
    table_trailer ();

    begin_form (thispage);
    table_header ((const char **) 0, 0);
    begin_table_row (0);
    button_column ("poweron", "Power On");
    button_column ("poweroff", "Power Off");
    end_table_row ();
    begin_table_row (0);
    button_column ("apoweron", "Ambilight Power On");
    button_column ("apoweroff", "Ambilight Power Off");
    end_table_row ();
    begin_table_row (0);
    button_column ("learnir", "Learn IR remote control");
    button_column ("eepromdump", "EEPROM dump");
    end_table_row ();
    end_form ();

    if (! strcmp (action, "eepromdump"))
    {
        message = "Currently not implemented";
        // http_eeprom_dump ();
    }

    if (message)
    {
        http_send_FS ("<P><font color=green>");
        http_send (message);
        http_send_FS ("</font>\r\n");
    }

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * network page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_network (void)
{
    const char *                thispage = "network";
    const char *                header_cols[NETWORK_HEADER_COLS] = { "Name", "Value", "Key", "Action" };
    const char *                header_cols2[NETWORK_HEADER_COLS2] = { "Name", "Value", "Action" };
    char *                      action;
    const char *                message = (const char *) 0;
    const char *                alert_message = (const char *) 0;
    const char *                esp_firmware_version;
    char                        timezone_str[MAX_TIMEZONE_LEN+1];
    int                         networks;
    int                         idx;
    uint_fast16_t               utz;
    int_fast16_t                tz;
    STR_VAR *                   sv;
    uint_fast8_t                rtc             = 0;

    esp_firmware_version        = ESP_VERSION;

    utz = get_numvar (TIMEZONE_NUM_VAR);

    tz = utz & 0xFF;

    if (utz & 0x100)
    {
        tz = -tz;
    }

    action = http_get_param ("action");

    if (*action)
    {
        if (! strcmp (action, "savewlanlist"))
        {
            char * ssid = http_get_param ("ssidlist");
            char * key  = http_get_param ("keylist");

            http_header ("WordClock Network", (const char *) NULL, (const char *) NULL);
            http_send_FS ("<B>Connecting to Access Point, try again later.</B>");
            http_trailer ();
            http_flush ();

            wifi_connect (ssid, key);
            return 0;
        }
        else if (! strcmp (action, "savewlan"))
        {
            char * ssid = http_get_param ("ssid");
            char * key  = http_get_param ("key");

            if (strlen (key) < 10)
            {
                alert_message = "Minimum length of key is 10!";
            }
            else
            {
                http_header ("WordClock Network", (const char *) NULL, (const char *) NULL);
                http_send_FS ("<B>Restarting as Access Point, try again later.</B>");
                http_trailer ();
                http_flush ();

                wifi_ap (ssid, key);
                return 0;
            }
        }
        else if (! strcmp (action, "savetimeserver"))
        {
            char * newtimeserver = http_get_param ("timeserver");

            set_strvar (TIMESERVER_STR_VAR, newtimeserver);
            message = "Timeserver successfully changed.";
        }
        else if (! strcmp (action, "savetimezone"))
        {
            tz = atoi (http_get_param ("timezone"));

            if (tz < 0)
            {
                utz = -tz;
                utz |= 0x100;
            }
            else
            {
                utz = tz;
            }

            set_numvar (TIMEZONE_NUM_VAR, utz);
            message = "Timezone successfully changed.";
        }
        else if (! strcmp (action, "nettime"))
        {
            message = "Getting net time";
            rpc (GET_NET_TIME_RPC_VAR);
        }
        else if (! strcmp (action, "wps"))
        {
            http_header ("WordClock Network", (const char *) NULL, (const char *) NULL);
            http_send_FS ("<B>Connecting to AP via WPS, try again later.</B>");
            http_trailer ();
            http_flush ();

            wifi_wps ();
            return 0;
        }
    }

    sprintf (timezone_str, "%d", tz);

    http_header ("WordClock Network", (const char *) NULL, (const char *) NULL);
    begin_box ("WordClock Network");

    http_send_FS ("<table><tr><td>ESP8266 firmware</td><td>");
    http_send (esp_firmware_version);
    http_send_FS ("</td></tr>\r\n");

    http_send_FS ("<tr><td>IP address</td><td>");
    http_send (wifi_ip_address);
    http_send_FS ("</td></tr></table><P>\r\n");

    table_header (header_cols, NETWORK_HEADER_COLS);

    begin_table_row_form (thispage);
    text_column ("WLAN Client");
    http_send_FS ("<td>");
    networks = WiFi.scanNetworks();
    http_send_FS ("<select id=\"ssidlist\" name=\"ssidlist\">");

