RT-CUSTOMZ/WortUhr/Software/ESP8266/ESP-WordClock/http.cpp
    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * brightness page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_brightness (void)
{
    const char *    thispage = "brightness";
    const char *    header_cols[MAIN_HEADER_COLS]               = { "Brightness", "Value" };
    char            txtbuf[32];
    char            idbuf[32];
    char            valbuf[32];
    uint_fast8_t    val;
    char *          action;
    int             idx;
    uint_fast8_t    rtc                                         = 0;

    action = http_get_param ("action");

    if (*action)
    {
        if (! strncmp (action, "savedim", 7))
        {
            idx = atoi (action + 7);
            val = atoi (http_get_param (action + 4));
            set_num8_array (DISPLAY_DIMMED_COLORS, idx, val);
        }
    }

    http_header ("WordClock Brightness", (const char *) NULL, (const char *) NULL);
    begin_box ("WordClock Brightness");

    table_header (header_cols, MAIN_HEADER_COLS);

    for (idx = 0; idx < MAX_BRIGHTNESS + 1; idx++)         // from 0 to 15
    {
        val = get_num8_array (DISPLAY_DIMMED_COLORS, idx);

        sprintf (txtbuf, "%2d", idx);
        sprintf (idbuf, "dim%d", idx);
        sprintf (valbuf, "%d", val);
        table_row_slider (thispage, txtbuf, idbuf, valbuf, "0", "15");
    }

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

static void
select_icons (const char * id, const char * name)
{
    const char *  fname = (const char *) 0;
    char          icon_name[32 + 1];
    uint_fast16_t hardware_configuration;

    http_send_FS ("<select id=\"");
    http_send (id);
    http_send_FS ("\" name=\"");
    http_send (id);
    http_send_FS ("\">");

    SPIFFS.begin ();

    hardware_configuration = get_numvar (HARDWARE_CONFIGURATION_NUM_VAR);

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H: fname = "wc24h-icon.txt";  break;
            case HW_WC_12H: fname = "wc12h-icon.txt";  break;
        }
    }

    if (fname)
    {
        File    fp;

        fp = SPIFFS.open (fname, "r");
    
        if (fp)
        {
            int     ch;
            int     i;

            ch = fp.read ();
        
            while (ch == '*')
            {
                i = 0;
        
                while ((ch = fp.read ()) != EOF)
                {
                    if (ch == '\r' || ch == '\n')
                    {
                        break;
                    }

                    if (i < 32)
                    {
                        icon_name[i++] = ch;
                    }
                }
        
                icon_name[i] = '\0';
                trim (icon_name);
        
                http_send_FS ("<option value=\"");
                http_send (icon_name);
                http_send_FS ("\"");
        
                if (! strcmp (name, icon_name))
                {
                    http_send_FS (" selected");
                }
        
                http_send_FS (">");
                http_send (icon_name);
                http_send_FS ("</option>\r\n");
        
                while ((ch = fp.read()) != '*' && ch >= 0)
                {
                    ;
                }
            }
    
            fp.close ();
        }
    }

    SPIFFS.end ();

    http_send_FS ("</select>\r\n");
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * display page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_display (void)
{
    const char *        thispage = "display";
    const char *        header_cols[DISPLAY_HEADER_COLS]  = { "Name", "Value", "Action" };
    char *              action;
    const char *        message         = (const char *) 0;
    uint_fast8_t        use_rgbw        = get_numvar (DISPLAY_USE_RGBW_NUM_VAR);
    DSP_COLORS          rgbw;
    const char *        ids[4]          = { "red", "green", "blue", "white" };
    const char *        desc[4]         = { "R", "G", "B", "W" };
    char *              rgbw_buf[4];
    const char *        minval[4]       = { "0",   "0",  "0",  "0" };
    const char *        maxval[4]       = { "63", "63", "63", "63" };
    const char *        display_mode_names[MAX_DISPLAY_MODE_VARIABLES];
    uint_fast8_t        max_display_modes;
    int                 color_animation_mode;
    uint_fast8_t        auto_brightness_active;
    uint_fast8_t        display_brightness;
    char                brbuf[MAX_BRIGHTNESS_LEN + 1];
    char                red_buf[MAX_COLOR_VALUE_LEN + 1];
    char                green_buf[MAX_COLOR_VALUE_LEN + 1];
    char                blue_buf[MAX_COLOR_VALUE_LEN + 1];
    char                white_buf[MAX_COLOR_VALUE_LEN + 1];
    int                 display_mode;
    uint_fast8_t        idx;
    uint_fast8_t        display_flags;
    uint_fast8_t        permanent_display_of_it_is;
    uint_fast8_t        ticker_deceleration;
    uint_fast8_t        rtc = 0;

    display_mode                    = get_numvar (DISPLAY_MODE_NUM_VAR);
    max_display_modes               = get_numvar (MAX_DISPLAY_MODES_NUM_VAR);
    display_flags                   = get_numvar (DISPLAY_FLAGS_NUM_VAR);
    color_animation_mode            = get_numvar (COLOR_ANIMATION_MODE_NUM_VAR);
    display_brightness              = get_numvar (DISPLAY_BRIGHTNESS_NUM_VAR);
    auto_brightness_active          = get_numvar (DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR);
    ticker_deceleration             = get_numvar (TICKER_DECELRATION_NUM_VAR);

    get_dsp_color_var (DISPLAY_DSP_COLOR_VAR, &rgbw);

    permanent_display_of_it_is      = (display_flags & DISPLAY_FLAGS_PERMANENT_IT_IS) ? 1 : 0;

    for (idx = 0; idx < max_display_modes; idx++)
    {
        DISPLAY_MODE * dm = get_display_mode_var ((DISPLAY_MODE_VARIABLE) idx);
        display_mode_names[idx] = dm->name;
    }

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "saveitis"))
        {
            if (http_get_checkbox_param ("itis"))
            {
                permanent_display_of_it_is = 1;
                display_flags |= DISPLAY_FLAGS_PERMANENT_IT_IS;
            }
            else
            {
                permanent_display_of_it_is = 0;
                display_flags &= ~DISPLAY_FLAGS_PERMANENT_IT_IS;
            }

            set_numvar (DISPLAY_FLAGS_NUM_VAR, display_flags);
        }
        else if (! strcmp (action, "savebrightness"))
        {
            display_brightness = atoi (http_get_param ("brightness"));
            set_numvar (DISPLAY_BRIGHTNESS_NUM_VAR, display_brightness);
        }
        else if (! strcmp (action, "savecolors"))
        {
            rgbw.red     = atoi (http_get_param ("red"));
            rgbw.green   = atoi (http_get_param ("green"));
            rgbw.blue    = atoi (http_get_param ("blue"));

