RT-CUSTOMZ/WortUhr/Software/ESP8266/ESP-WordClock/http.cpp
                        if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
                        {
                            fname[l++] = ch;
                        }
                        else if (ch == '\n')
                        {
                            int show_option;

                            fname[l] = '\0';
                            l = 0;

                            show_option = 1;

                            if (filter)
                            {
                                if (strncmp (fname + 6, filter, strlen (filter)) != 0)
                                {
                                    show_option = 0;
                                }
                            }

                            if (show_option)
                            {
                                http_send_FS ("<option value=\"");
                                http_send (fname);
        
                                if (! strcmp (fname, stm32_default_filename))
                                {
                                    http_send_FS ("\" selected>");
                                }
                                else
                                {
                                    http_send_FS ("\">");
                                }
        
                                http_send (fname);
                                http_send_FS ("</option>\r\n");
                            }
                        }
                    }
    
                    httpclient_stop ();
                    http_flush ();
                }
                else
                {
                   Serial.print("Error in HTTP request: ");
                   Serial.println(WC_LIST_TXT);
                }
                http_send_FS ("</select>\r\n");
    
                http_send_FS ("<button type=\"submit\" name=\"action\" value=\"flash\">Flash STM32</button>"
                              "</form>"
                              "<P>\r\n");
            }

            end_box ();
            http_trailer ();
            http_flush ();
        }
    }
    else
    {
        http_send_FS ("<font color=red><B>Flash size of ESP8266 is too small for Update over OTA</B></font><BR>\r\n");
        end_box ();
        http_trailer ();
        http_flush ();
    }

    return rtc;
}

String
sanitize_xml_string(const String& str)
{
    String result;
    for (unsigned int i = 0; i < str.length(); i++)
    {
        switch (str[i])
        {
        case '&':
            result += "&amp;";
            break;
        case '<':
            result += "&lt;";
            break;
        case '>':
            result += "&gt;";
            break;
        default:
            result += str[i];
            break;
        }
    }
    return result;
}

static int
http_get_settings()
{
    char  buff[255];
    int   i;

    http_send(FS("HTTP/1.0 200 OK\r\n\r\n"));
    http_send(FS("<settings>"));

    // num vars
    for (i = 0; i < MAX_NUM_VARIABLES; i++)
    {
        sprintf(buff, FS("<numvar idx=\"%d\" value=\"%d\" />"), i, numvars[i]);
        http_send(buff);
    }

    // string vars
    for (i = 0; i < MAX_STR_VARIABLES; i++)
    {
        sprintf(buff, FS("<strvar idx=\"%d\" value=\"%s\" />"), i, sanitize_xml_string(strvars[i].str).c_str());
        http_send(buff);
    }

    // colors
    for (i = 0; i < MAX_DSP_COLOR_VARIABLES; i++)
    {
        sprintf(buff, FS("<dspcolor idx=\"%d\" red=\"%d\" green=\"%d\" blue=\"%d\" white=\"%d\" />"), i, dspcolorvars[i].red, dspcolorvars[i].green, dspcolorvars[i].blue, dspcolorvars[i].white);
        http_send(buff);
    }

    // display modes
    for (i = 0; i < MAX_DISPLAY_MODE_VARIABLES; i++)
    {
        sprintf(buff, FS("<dispmode idx=\"%d\" name=\"%s\" />"), i, sanitize_xml_string(displaymodevars[i].name).c_str());
        http_send(buff);
    }

    // display animations
    for (i = 0; i < MAX_DISPLAY_ANIMATION_VARIABLES; i++)
    {
        sprintf(buff, FS("<dispanim idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(displayanimationvars[i].name).c_str(),
            displayanimationvars[i].deceleration,
            displayanimationvars[i].default_deceleration,
            displayanimationvars[i].flags);
        http_send(buff);
    }

    // color animations
    for (i = 0; i < MAX_COLOR_ANIMATION_VARIABLES; i++)
    {
        sprintf(buff, FS("<coloranim idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(coloranimationvars[i].name).c_str(),
            coloranimationvars[i].deceleration,
            coloranimationvars[i].default_deceleration,
            coloranimationvars[i].flags);
        http_send(buff);
    }

    // ambilight modes
    for (i = 0; i < MAX_AMBILIGHT_MODE_VARIABLES; i++)
    {
        sprintf(buff, FS("<almode idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(ambilightmodevars[i].name).c_str(),
            ambilightmodevars[i].deceleration,
            ambilightmodevars[i].default_deceleration,
            ambilightmodevars[i].flags);
        http_send(buff);
    }

    // night times
    for (i = 0; i < MAX_NIGHT_TIME_VARIABLES; i++)
    {
        sprintf(buff, FS("<nighttime idx=\"%d\" minutes=\"%d\" flags=\"%d\"/>"), i, nighttimevars[i].minutes, nighttimevars[i].flags);
        http_send(buff);
    }

    http_send(FS("</settings>"));
    http_flush();

    return 0;
}

static void
reset_button (void)
{
    http_send_FS ("<form method=\"GET\" action=\"/flash_stm32_local\" style=\"display:inline\">"
                  "<button type=\"submit\" name=\"action\" value=\"reset\">Reset STM32</button>"
                  "</form>\r\n");

}
static uint_fast8_t
flash_stm32_local (bool post = false)
{
    char *              action;
    int                 do_reset = 0;
    uint32_t            flashsize;

    flashsize = ESP.getFlashChipRealSize ();

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "reset"))
        {
            do_reset = 1;
        }
    }

    if (flashsize >= 1048576)
    {
        if (post)
        {
            String line;

            // find the line with content type and boundary string
            String boundary;

            while (read_line(line))
            {
                if (line.startsWith("Content-Type:"))
                {
                    int n = line.indexOf("boundary=");
                    if (n > 0)
                    {
                        boundary = "--" + line.substring(n + strlen("boundary="));
                    }
                    break;
                }
            }

            // no boundary? something is wrong
            if (boundary == "")
            {
                http_header("WordClock Local Update", NULL, NULL);
                begin_box ("WordClock Local Update");
                http_send_FS ("<font color='red'>Wrong http header</font><br/>");
            }
            else
            {
                int i;

                // read until a boundary has been found
                while(read_line(line) && line != boundary)
                {
                    ;
                }

                // read the empty line
                while (read_line(line) && line != "")
                {
                    ;
                }

                SPIFFS.begin();
                File f = SPIFFS.open("stm32.hex", "w+");

                if (f)
                {
                    // read and save file content until the boundary has been found
                    while (read_line(line))
                    {
                        // boundary found, end of file
                        if (line == boundary)
                        {
                            break;
                        }
                        f.write((const unsigned char*)line.c_str(), line.length());
                        f.write('\n');
                    }
    
                    f.close();

